Aula - Roteamento Dinâmico

	RIP - Routing Information Protocol
	
configurando o primeiro roteador 

router local 1
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#
Router(config)#router rip
Router(config-router)#network 200.200.200.0
Router(config-router)#network 200.200.210.0
Router(config-router)#
Router#


router ISP1	
Router>
Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#
Router(config-router)#end
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#
%SYS-5-CONFIG_I: Configured from console by console
network 200.200.210.0
Router(config-router)#network 200.200.203.0
Router(config-router)#network 200.200.201.0
Router(config-router)#
Router(config-router)#
Router(config-router)#do show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

R    200.200.200.0/24 [120/1] via 200.200.210.2, 00:00:22, GigabitEthernet0/0
     200.200.201.0/24 is variably subnetted, 2 subnets, 2 masks
C       200.200.201.0/30 is directly connected, GigabitEthernet0/1
L       200.200.201.1/32 is directly connected, GigabitEthernet0/1
     200.200.203.0/24 is variably subnetted, 2 subnets, 2 masks
C       200.200.203.0/30 is directly connected, GigabitEthernet0/2
L       200.200.203.1/32 is directly connected, GigabitEthernet0/2
     200.200.210.0/24 is variably subnetted, 2 subnets, 2 masks
C       200.200.210.0/30 is directly connected, GigabitEthernet0/0
L       200.200.210.1/32 is directly connected, GigabitEthernet0/0

Router(config-router)#

Ao configurar esse roteador podemos perceber que ele aprende e conhece a rede 200.200.200.0 que é da rede roxa, por isso ele tem a letra R na frente

router ISP2
Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#network 200.200.203.0
Router(config-router)#network 200.200.204.0
Router(config-router)#network 200.200.205.0
Router(config-router)#



router ISP3

Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#network 200.200.201.0
Router(config-router)#network 200.200.202.0
Router(config-router)#
Router(config-router)#end



router ISP4

Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#network 200.200.205.0
Router(config-router)#network 200.200.206.0
Router(config-router)#

ROUTER ISP5

Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#network 200.200.204.0
Router(config-router)#network 200.200.206.0
Router(config-router)#network 200.200.207.0
Router(config-router)#

ROUTER ISP6

Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#network 200.200.202.0
Router(config-router)#network 200.200.207.0
Router(config-router)#network 200.200.208.0
Router(config-router)#

router local2

Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#network 200.200.208.0
Router(config-router)#network 200.200.209.0
Router(config-router)#


